# поставити Node
# FROM — задає базовий образ.
FROM  node

# створи пусту папку під проект app
# WORKDIR — задає роботу папку для для наступних інструкції
WORKDIR /app

#  скопіюй файли проекта в папку app
# COPY — копіює в контейнер файли і папки.
COPY . . 

# постав пакети з packege.json
# RUN — виконує команду створює шар образа. Використовується для встановлення в контейнер пакетів.
RUN npm install

#номер порта на якому запускаємо
# EXPOSE — вказує, що необхідновідкрити порт.
EXPOSE 3000

# запусти проект даною командою
# CMD — описує команду з аргументами, яку необхідно виконати коли контейнер будет запущено. 
CMD ["node", "./server.js"]




# FROM — задає базовий образ.

# WORKDIR — задає роботу папку для для наступних інструкції

# LABEL — описує метаданні. Наприклад — дані про те, хто створив і підтримує образ.
# ENV — встановлює постійні змінні оточення.
# COPY — копіює в контейнер файли і папки.


# RUN — виконує команду створює шар образа. Використовується для встановлення в контейнер пакетів.


# ADD — копіює файли і папки в контейнер, може распаковувати локальні .tar-файли.
# ARG — створює змінні для передачі в Docker під час збирання образу.
# ENTRYPOINT — надає команду з аргументами для виклику під час виконання контейнера. Аргументи не перевизначаються.
# EXPOSE — вказує, що необхідновідкрити порт.

# VOLUME — створює точку монтування для работи з постійним сховищем.
# CMD — описує команду з аргументами, яку необхідно виконати коли контейнер будет запущено. 
# Аргументи можуть бути перевизначені при запуску контейнера. В файлі може бути присутнім лише одна інструкція CMD.

